app/Helpers/helper.php

function sendNotification($template, $options, $user_id = null, $group_id = null, $sender = 'system', $type = 'single')
{
    $templateId = getNotificationTemplates($template);
    $notificationTemplate = \App\Models\NotificationTemplate::where('id', $templateId)->first();

    if (!empty($notificationTemplate)) {
        $title = str_replace(array_keys($options), array_values($options), $notificationTemplate->title);
        $message = str_replace(array_keys($options), array_values($options), $notificationTemplate->template);

        $check = \App\Models\Notification::where('user_id', $user_id)
            ->where('group_id', $group_id)
            ->where('title', $title)
            ->where('message', $message)
            ->where('sender', $sender)
            ->where('type', $type)
            ->first();

        if (empty($check) or $template != 'new_badge') {
            \App\Models\Notification::create([
                'user_id' => $user_id,
                'group_id' => $group_id,
                'title' => $title,
                'message' => $message,
                'sender' => $sender,
                'type' => $type,
                'created_at' => time()
            ]);
---
select * from `notification_templates` where `id` = '5' limit 1
select * from `notifications` where `user_id` = '870' and `group_id` is null and `title` = 'Your class approved' and `message` = '<p>Your class khóa dạy làm người successfully approved. Now you can find it on the website.</p>' and `sender` = 'system' and `type` = 'single' limit 1
insert into `notifications` (`user_id`, `group_id`, `title`, `message`, `sender`, `type`, `created_at`) values ('870', '', 'Your class approved', '<p>Your class khóa dạy làm người successfully approved. Now you can find it on the website.</p>', 'system', 'single', 1684250518)