app/Models/Category.php

    static function getCategories()
    {
        $categories = cache()->remember(self::$cacheKey, 24 * 60 * 60, function () {
            return self::whereNull('parent_id')
                ->with([
                    'subCategories' => function ($query) {
                        $query->orderBy('order', 'asc');
                    },
                ])
                ->get();
        });
---
select * from `categories` where `categories`.`parent_id` = 706 and `categories`.`parent_id` is not null order by `order` asc