app/Models/Webinar.php

    public function getDiscountPercent()
    {
        $percent = 0;

        $activeSpecialOffer = $this->activeSpecialOffer();

        if (!empty($activeSpecialOffer)) {
            $percent += $activeSpecialOffer->percent;
        }

        $tickets = Ticket::where('webinar_id', $this->id)->get();
---
select * from `tickets` where `webinar_id` = 2020

    public function checkUserHasBought($user = null)
    {
        $hasBought = false;

        if (empty($user) and auth()->check()) {
            $user = auth()->user();
        }

        if (!empty($user)) {
            $sale = Sale::where('buyer_id', $user->id)
                ->where('webinar_id', $this->id)
                ->where('type', 'webinar')
                ->whereNull('refund_at')
                ->first();
---
select * from `sales` where `buyer_id` = 1046 and `webinar_id` = 1996 and `type` = 'webinar' and `refund_at` is null limit 1

    public function activeSpecialOffer()
    {
        $activeSpecialOffer = SpecialOffer::where('webinar_id', $this->id)
            ->where('status', SpecialOffer::$active)
            ->where('from_date', '<', time())
            ->where('to_date', '>', time())
            ->first();
---
select * from `special_offers` where `webinar_id` = 2020 and `status` = 'active' and `from_date` < 1684249866 and `to_date` > 1684249866 limit 1