app/Http/Controllers/Admin/CategoryController.php

    public function index()
    {
        $this->authorize('admin_categories_list');

        $categories = Category::where('parent_id', null)
            ->orderBy('id', 'desc')
            ->paginate(10);
---
select * from `categories` where `parent_id` is null order by `id` desc limit 10 offset 0
select count(*) as aggregate from `categories` where `parent_id` is null