app/Http/Controllers/Admin/WebinarController.php

select count(*) as aggregate from `webinars` where `webinars`.`type` = 'course'
select count(*) as aggregate from `webinars` where `webinars`.`type` = 'course' and `webinars`.`status` = 'pending'
select sum(`duration`) as aggregate from `webinars` where `webinars`.`type` = 'course'
select count(sales.webinar_id) as sales_count from `webinars` inner join `sales` on `webinars`.`id` = `sales`.`webinar_id` where `webinars`.`type` = 'course' and `sales`.`webinar_id` is not null and `sales`.`refund_at` is null limit 1
select * from `categories` where `parent_id` is null
---
    public function index(Request $request)
    {
        $this->authorize('admin_webinars_list');

        $type = $request->get('type', 'webinar');
        $query = Webinar::where('webinars.type', $type);

        $totalWebinars = $query->count();
        $totalPendingWebinars = deepClone($query)->where('webinars.status', 'pending')->count();
        $totalDurations = deepClone($query)->sum('duration');
        $totalSales = deepClone($query)->join('sales', 'webinars.id', '=', 'sales.webinar_id')
            ->select(DB::raw('count(sales.webinar_id) as sales_count'))
            ->whereNotNull('sales.webinar_id')
            ->whereNull('sales.refund_at')
            ->first();

        $categories = Category::where('parent_id', null)
            ->with('subCategories')
            ->get();

select * from `users` where `role_name` = 'teacher'
select * from `categories` where `parent_id` is null
---
    public function create()
    {
        $this->authorize('admin_webinars_create');

        $teachers = User::where('role_name', Role::$teacher)->get();
        $categories = Category::where('parent_id', null)->get();

select * from `categories` where `categories`.`id` in (657)
select * from `faqs` where `faqs`.`webinar_id` in (2022)
select * from `files` where `files`.`webinar_id` in (2022)
select * from `filters` where `filters`.`category_id` in (657)
---
    public function edit($id)
    {
        $this->authorize('admin_webinars_edit');

        $webinar = Webinar::where('id', $id)
            ->with([
                'tickets',
                'sessions',
                'files',
                'faqs',
                'category' => function ($query) {
                    $query->with(['filters' => function ($query) {
                        $query->with('options');
                    }]);
                },
                'filterOptions',
                'prerequisites',
                'quizzes',
                'webinarPartnerTeacher' => function ($query) {
                    $query->with(['teacher' => function ($query) {
                        $query->select('id', 'full_name');
                    }]);
                },
                'tags',
                'textLessons'
            ])
            ->first();

select * from `users` where `role_name` = 'teacher'
select * from `categories` where `parent_id` is null
---
            abort(404);
        }

        $teachers = User::where('role_name', Role::$teacher)->get();
        $categories = Category::where('parent_id', null)
            ->with('subCategories')
            ->get();

select * from `chapter` where `webinar_id` = 2022
---

        $tags = $webinar->tags->pluck('title')->toArray();

        $chapers = DB::table('chapter')->where('webinar_id',$webinar->id)->get();

select * from `webinars` where `webinars`.`id` = '2023' limit 1
select * from `users` where `users`.`id` = 870 limit 1
---
    public function update(Request $request, $id)
    {
        $this->authorize('admin_webinars_edit');
        $data = $request->all();

        $webinar = Webinar::find($id);
        $isDraft = (!empty($data['draft']) and $data['draft'] == 1);
        $reject = (!empty($data['draft']) and $data['draft'] == 'reject');
        $publish = (!empty($data['draft']) and $data['draft'] == 'publish');

        $rules = [
            'type' => 'required|in:webinar,course,text_lesson',
            'title' => 'required|max:255',
            'thumbnail' => 'required',
            'image_cover' => 'required',
            'description' => 'required',
            'teacher_id' => 'required|exists:users,id',
            'category_id' => 'required',
        ];

        if ($webinar->isWebinar()) {
            $rules['start_date'] = 'required|date';
            $rules['duration'] = 'required';
            $rules['capacity'] = 'required|integer';
        }

        $this->validate($request, $rules);

        if (!empty($data['teacher_id'])) {
            $teacher = User::find($data['teacher_id']);

delete from `webinar_partner_teacher` where `webinar_id` = 2023
---
        $data['partner_instructor'] = !empty($data['partner_instructor']) ? true : false;

        if (empty($data['partner_instructor'])) {
            WebinarPartnerTeacher::where('webinar_id', $webinar->id)->delete();

delete from `webinar_filter_option` where `webinar_id` = 2023
---
        }

        if ($data['category_id'] !== $webinar->category_id) {
            WebinarFilterOption::where('webinar_id', $webinar->id)->delete();

delete from `tags` where `webinar_id` = 2019
insert into `tags` (`webinar_id`, `title`) values (2019, '5')
---

        if (!empty($request->get('tags'))) {
            $tags = explode(',', $request->get('tags'));
            Tag::where('webinar_id', $webinar->id)->delete();

            foreach ($tags as $tag) {
                Tag::create([
                    'webinar_id' => $webinar->id,
                    'title' => $tag,
                ]);

delete from `webinars` where `id` = 2021
select * from `webinars` where `webinars`.`id` = '2021' limit 1
---
    public function destroy(Request $request, $id)
    {
        $this->authorize('admin_webinars_delete');

        Webinar::find($id)->delete();